Carlanga09/STM32F103-Automatic-Irrigation-Controller/CubeIDE/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define ENC_A_Pin GPIO_PIN_0
#define ENC_A_GPIO_Port GPIOA
#define ENC_B_Pin GPIO_PIN_1
#define ENC_B_GPIO_Port GPIOA
#define ENC_SW_Pin GPIO_PIN_2
#define ENC_SW_GPIO_Port GPIOA
#define IN01_Pin GPIO_PIN_4
#define IN01_GPIO_Port GPIOA
#define IN02_Pin GPIO_PIN_5
#define IN02_GPIO_Port GPIOA
#define IN03_Pin GPIO_PIN_6
#define IN03_GPIO_Port GPIOA
#define IN04_Pin GPIO_PIN_7
#define IN04_GPIO_Port GPIOA
#define BEEP_Pin GPIO_PIN_0
#define BEEP_GPIO_Port GPIOB
#define LED_HB_Pin GPIO_PIN_1
#define LED_HB_GPIO_Port GPIOB
#define SD_CD_Pin GPIO_PIN_2
#define SD_CD_GPIO_Port GPIOB
#define SD_NSS_Pin GPIO_PIN_12
#define SD_NSS_GPIO_Port GPIOB
#define SD_SCK_Pin GPIO_PIN_13
#define SD_SCK_GPIO_Port GPIOB
#define SD_MISO_Pin GPIO_PIN_14
#define SD_MISO_GPIO_Port GPIOB
#define SD_MOSI_Pin GPIO_PIN_15
#define SD_MOSI_GPIO_Port GPIOB
#define TANK_SW_Pin GPIO_PIN_15
#define TANK_SW_GPIO_Port GPIOA
#define LCD_SCK_Pin GPIO_PIN_3
#define LCD_SCK_GPIO_Port GPIOB
#define LCD_BL_Pin GPIO_PIN_4
#define LCD_BL_GPIO_Port GPIOB
#define LCD_MOSI_Pin GPIO_PIN_5
#define LCD_MOSI_GPIO_Port GPIOB
#define CH01_Pin GPIO_PIN_6
#define CH01_GPIO_Port GPIOB
#define CH02_Pin GPIO_PIN_7
#define CH02_GPIO_Port GPIOB
#define CH03_Pin GPIO_PIN_8
#define CH03_GPIO_Port GPIOB
#define CH04_Pin GPIO_PIN_9
#define CH04_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
